examples/consistency/dustyWave/system/controlDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object controlDict;
}

application dustyWaveUGKP;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime 0.2;
deltaT 0.0005;
writeControl runTime;
writeInterval 0.02;
purgeWrite 0;
writeFormat ascii;
writePrecision 14;
writeCompression off;
timeFormat general;
timePrecision 10;
runTimeModifiable false;
adjustTimeStep false;
maxCo 0.5;
maxDeltaT 0.0005;
