examples/consistency/dustyWave/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 0 0)
    (4 0 0)
    (4 1 0)
    (0 1 0)
    (0 0 1)
    (4 0 1)
    (4 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (400 1 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    left
    {
        type patch;
        faces ((0 4 7 3));
    }
    right
    {
        type patch;
        faces ((1 2 6 5));
    }
    sides
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs ();
