examples/consistency/dustyWave/constant/radiationProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object radiationProperties;
}

schemaVersion 1;
enabled false;
model
{
}
