examples/consistency/dustyWave/0/epsilonS
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilonS;
}

dimensions [0 0 0 0 0 0 0];
internalField nonuniform List<scalar>
400
(
9.9999999999999995e-07
1.0010000000000002e-06
1.0020000000000001e-06
1.0020000000000001e-06
1.003e-06
1.003e-06
1.004e-06
1.0050000000000001e-06
...
);

boundaryField
{
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    sides
    {
        type empty;
    }
}
