examples/consistency/dustyWave/0/rho
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}

dimensions [1 -3 0 0 0 0 0];
internalField nonuniform List<scalar>
400
(
1.0003141075907813
1.0009410831331851
1.0015643446504023
1.0021814324139655
1.0027899110603924
1.003387379202453
1.0039714789063479
1.0045399049973955
...
);

boundaryField
{
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    sides
    {
        type empty;
    }
}
