examples/consistency/dustyWave/0/theta
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      theta;
}

dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;

boundaryField
{
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    sides
    {
        type empty;
    }
}
