examples/consistency/dustyWave/system/fvSchemes
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object fvSchemes;
}

fluxScheme hllKurganov;
gasLimiter barthJespersen;

ddtSchemes
{
    default SSPRK2;
}
gradSchemes
{
    default Gauss linear;
    grad(phiLS) cellLimited Gauss linear 1;
}
divSchemes
{
    default none;
    div(phi,U) Gauss MUSCL;
    div(phid,p) Gauss limitedLinear 1;
    div(phi,e) Gauss MUSCL;
    div(phi,K) Gauss MUSCL;
    div(phi,(p|rho)) Gauss MUSCL;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
    default Gauss linear corrected;
}
interpolationSchemes
{
    default linear;
}
snGradSchemes
{
    default corrected;
}
wallDist
{
    method meshWave;
}
